Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_tim2.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32L4R5_tim2 equates.
 */

#pragma once

#include    <stdint.h>

// TIM2 address definitions
// ------------------------

typedef struct {
    volatile    uint16_t    CR1;
    volatile    uint16_t    RESERVED0;
    volatile    uint16_t    CR2;
    volatile    uint16_t    RESERVED1;
    volatile    uint32_t    SMCR;
    volatile    uint16_t    DIER;
    volatile    uint16_t    RESERVED2;
    volatile    uint16_t    SR;
    volatile    uint16_t    RESERVED3;
    volatile    uint16_t    EGR;
    volatile    uint16_t    RESERVED4;
        union {
    volatile    uint32_t    CCMR1;
    volatile    uint32_t    CCMR1_ALTERNATE;
        };
        union {
    volatile    uint32_t    CCMR2;
    volatile    uint32_t    CCMR2_ALTERNATE;
        };
    volatile    uint16_t    CCER;
    volatile    uint16_t    RESERVED5;
        union {
    volatile    uint32_t    CNT;
    volatile    uint32_t    CNT_ALTERNATE;
        };
    volatile    uint16_t    PSC;
    volatile    uint16_t    RESERVED6;
    volatile    uint32_t    ARR;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    CCR1;
    volatile    uint32_t    CCR2;
    volatile    uint32_t    CCR3;
    volatile    uint32_t    CCR4;
    volatile    uint32_t    RESERVED8;
    volatile    uint16_t    DCR;
    volatile    uint16_t    RESERVED9;
    volatile    uint16_t    DMAR;
    volatile    uint16_t    RESERVED10[9];
    volatile    uint32_t    AF1;
    volatile    uint32_t    RESERVED11;
    volatile    uint32_t    TISEL;
} TIM2_TypeDef;

#ifdef __cplusplus
#define TIM2    reinterpret_cast<TIM2_TypeDef *>(0x40000000U)

#else
#define TIM2    ((TIM2_TypeDef *)0x40000000U)
#endif

// CR1 Configuration

#define TIM2_CR1_UIFREMAP                   (0x1U<<11)
#define TIM2_CR1_CKD                        (0x3U<<8)
#define TIM2_CR1_CKD_0                      (0x1U<<8)
#define TIM2_CR1_ARPE                       (0x1U<<7)
#define TIM2_CR1_CMS                        (0x3U<<5)
#define TIM2_CR1_CMS_0                      (0x1U<<5)
#define TIM2_CR1_DIR                        (0x1U<<4)
#define TIM2_CR1_OPM                        (0x1U<<3)
#define TIM2_CR1_URS                        (0x1U<<2)
#define TIM2_CR1_UDIS                       (0x1U<<1)
#define TIM2_CR1_CEN                        (0x1U<<0)
#define TIM2_CR1_UIFREMAP_B_0X0             (0x0U<<11)
#define TIM2_CR1_UIFREMAP_B_0X1             (0x1U<<11)
#define TIM2_CR1_CKD_B_0X0                  (0x0U<<8)
#define TIM2_CR1_CKD_B_0X1                  (0x1U<<8)
#define TIM2_CR1_CKD_B_0X2                  (0x2U<<8)
#define TIM2_CR1_ARPE_B_0X0                 (0x0U<<7)
#define TIM2_CR1_ARPE_B_0X1                 (0x1U<<7)
#define TIM2_CR1_CMS_B_0X0                  (0x0U<<5)
#define TIM2_CR1_CMS_B_0X1                  (0x1U<<5)
#define TIM2_CR1_CMS_B_0X2                  (0x2U<<5)
#define TIM2_CR1_CMS_B_0X3                  (0x3U<<5)
#define TIM2_CR1_DIR_B_0X0                  (0x0U<<4)
#define TIM2_CR1_DIR_B_0X1                  (0x1U<<4)
#define TIM2_CR1_OPM_B_0X0                  (0x0U<<3)
#define TIM2_CR1_OPM_B_0X1                  (0x1U<<3)
#define TIM2_CR1_URS_B_0X0                  (0x0U<<2)
#define TIM2_CR1_URS_B_0X1                  (0x1U<<2)
#define TIM2_CR1_UDIS_B_0X0                 (0x0U<<1)
#define TIM2_CR1_UDIS_B_0X1                 (0x1U<<1)
#define TIM2_CR1_CEN_B_0X0                  (0x0U<<0)
#define TIM2_CR1_CEN_B_0X1                  (0x1U<<0)

// CR2 Configuration

#define TIM2_CR2_TI1S                       (0x1U<<7)
#define TIM2_CR2_MMS                        (0x7U<<4)
#define TIM2_CR2_MMS_0                      (0x1U<<4)
#define TIM2_CR2_CCDS                       (0x1U<<3)
#define TIM2_CR2_TI1S_B_0X0                 (0x0U<<7)
#define TIM2_CR2_TI1S_B_0X1                 (0x1U<<7)
#define TIM2_CR2_MMS_B_0X0                  (0x0U<<4)
#define TIM2_CR2_MMS_B_0X1                  (0x1U<<4)
#define TIM2_CR2_MMS_B_0X2                  (0x2U<<4)
#define TIM2_CR2_MMS_B_0X3                  (0x3U<<4)
#define TIM2_CR2_MMS_B_0X4                  (0x4U<<4)
#define TIM2_CR2_MMS_B_0X5                  (0x5U<<4)
#define TIM2_CR2_MMS_B_0X6                  (0x6U<<4)
#define TIM2_CR2_MMS_B_0X7                  (0x7U<<4)
#define TIM2_CR2_CCDS_B_0X0                 (0x0U<<3)
#define TIM2_CR2_CCDS_B_0X1                 (0x1U<<3)

// SMCR Configuration

#define TIM2_SMCR_TS_1                      (0x3U<<20)
#define TIM2_SMCR_TS_1_0                    (0x1U<<20)
#define TIM2_SMCR_SMS_1                     (0x1U<<16)
#define TIM2_SMCR_ETP                       (0x1U<<15)
#define TIM2_SMCR_ECE                       (0x1U<<14)
#define TIM2_SMCR_ETPS                      (0x3U<<12)
#define TIM2_SMCR_ETPS_0                    (0x1U<<12)
#define TIM2_SMCR_ETF                       (0xFU<<8)
#define TIM2_SMCR_ETF_0                     (0x1U<<8)
#define TIM2_SMCR_MSM                       (0x1U<<7)
#define TIM2_SMCR_TS                        (0x7U<<4)
#define TIM2_SMCR_TS_0                      (0x1U<<4)
#define TIM2_SMCR_SMS                       (0x7U<<0)
#define TIM2_SMCR_SMS_0                     (0x1U<<0)
#define TIM2_SMCR_ETP_B_0X0                 (0x0U<<15)
#define TIM2_SMCR_ETP_B_0X1                 (0x1U<<15)
#define TIM2_SMCR_ECE_B_0X0                 (0x0U<<14)
#define TIM2_SMCR_ECE_B_0X1                 (0x1U<<14)
#define TIM2_SMCR_ETPS_B_0X0                (0x0U<<12)
#define TIM2_SMCR_ETPS_B_0X1                (0x1U<<12)
#define TIM2_SMCR_ETPS_B_0X2                (0x2U<<12)
#define TIM2_SMCR_ETPS_B_0X3                (0x3U<<12)
#define TIM2_SMCR_ETF_B_0X0                 (0x0U<<8)
#define TIM2_SMCR_ETF_B_0X1                 (0x1U<<8)
#define TIM2_SMCR_ETF_B_0X2                 (0x2U<<8)
#define TIM2_SMCR_ETF_B_0X3                 (0x3U<<8)
#define TIM2_SMCR_ETF_B_0X4                 (0x4U<<8)
#define TIM2_SMCR_ETF_B_0X5                 (0x5U<<8)
#define TIM2_SMCR_ETF_B_0X6                 (0x6U<<8)
#define TIM2_SMCR_ETF_B_0X7                 (0x7U<<8)
#define TIM2_SMCR_ETF_B_0X8                 (0x8U<<8)
#define TIM2_SMCR_ETF_B_0X9                 (0x9U<<8)
#define TIM2_SMCR_ETF_B_0XA                 (0xAU<<8)
#define TIM2_SMCR_ETF_B_0XB                 (0xBU<<8)
#define TIM2_SMCR_ETF_B_0XC                 (0xCU<<8)
#define TIM2_SMCR_ETF_B_0XD                 (0xDU<<8)
#define TIM2_SMCR_ETF_B_0XE                 (0xEU<<8)
#define TIM2_SMCR_ETF_B_0XF                 (0xFU<<8)
#define TIM2_SMCR_MSM_B_0X0                 (0x0U<<7)
#define TIM2_SMCR_MSM_B_0X1                 (0x1U<<7)
#define TIM2_SMCR_TS_B_0X0                  (0x0U<<4)
#define TIM2_SMCR_TS_B_0X1                  (0x1U<<4)
#define TIM2_SMCR_TS_B_0X2                  (0x2U<<4)
#define TIM2_SMCR_TS_B_0X3                  (0x3U<<4)
#define TIM2_SMCR_TS_B_0X4                  (0x4U<<4)
#define TIM2_SMCR_TS_B_0X5                  (0x5U<<4)
#define TIM2_SMCR_TS_B_0X6                  (0x6U<<4)
#define TIM2_SMCR_TS_B_0X7                  (0x7U<<4)
#define TIM2_SMCR_SMS_B_0X0                 (0x0U<<0)
#define TIM2_SMCR_SMS_B_0X1                 (0x1U<<0)
#define TIM2_SMCR_SMS_B_0X2                 (0x2U<<0)
#define TIM2_SMCR_SMS_B_0X3                 (0x3U<<0)
#define TIM2_SMCR_SMS_B_0X4                 (0x4U<<0)
#define TIM2_SMCR_SMS_B_0X5                 (0x5U<<0)
#define TIM2_SMCR_SMS_B_0X6                 (0x6U<<0)
#define TIM2_SMCR_SMS_B_0X7                 (0x7U<<0)

// DIER Configuration

#define TIM2_DIER_TDE                       (0x1U<<14)
#define TIM2_DIER_CC4DE                     (0x1U<<12)
#define TIM2_DIER_CC3DE                     (0x1U<<11)
#define TIM2_DIER_CC2DE                     (0x1U<<10)
#define TIM2_DIER_CC1DE                     (0x1U<<9)
#define TIM2_DIER_UDE                       (0x1U<<8)
#define TIM2_DIER_TIE                       (0x1U<<6)
#define TIM2_DIER_CC4IE                     (0x1U<<4)
#define TIM2_DIER_CC3IE                     (0x1U<<3)
#define TIM2_DIER_CC2IE                     (0x1U<<2)
#define TIM2_DIER_CC1IE                     (0x1U<<1)
#define TIM2_DIER_UIE                       (0x1U<<0)
#define TIM2_DIER_TDE_B_0X0                 (0x0U<<14)
#define TIM2_DIER_TDE_B_0X1                 (0x1U<<14)
#define TIM2_DIER_CC4DE_B_0X0               (0x0U<<12)
#define TIM2_DIER_CC4DE_B_0X1               (0x1U<<12)
#define TIM2_DIER_CC3DE_B_0X0               (0x0U<<11)
#define TIM2_DIER_CC3DE_B_0X1               (0x1U<<11)
#define TIM2_DIER_CC2DE_B_0X0               (0x0U<<10)
#define TIM2_DIER_CC2DE_B_0X1               (0x1U<<10)
#define TIM2_DIER_CC1DE_B_0X0               (0x0U<<9)
#define TIM2_DIER_CC1DE_B_0X1               (0x1U<<9)
#define TIM2_DIER_UDE_B_0X0                 (0x0U<<8)
#define TIM2_DIER_UDE_B_0X1                 (0x1U<<8)
#define TIM2_DIER_TIE_B_0X0                 (0x0U<<6)
#define TIM2_DIER_TIE_B_0X1                 (0x1U<<6)
#define TIM2_DIER_CC4IE_B_0X0               (0x0U<<4)
#define TIM2_DIER_CC4IE_B_0X1               (0x1U<<4)
#define TIM2_DIER_CC3IE_B_0X0               (0x0U<<3)
#define TIM2_DIER_CC3IE_B_0X1               (0x1U<<3)
#define TIM2_DIER_CC2IE_B_0X0               (0x0U<<2)
#define TIM2_DIER_CC2IE_B_0X1               (0x1U<<2)
#define TIM2_DIER_CC1IE_B_0X0               (0x0U<<1)
#define TIM2_DIER_CC1IE_B_0X1               (0x1U<<1)
#define TIM2_DIER_UIE_B_0X0                 (0x0U<<0)
#define TIM2_DIER_UIE_B_0X1                 (0x1U<<0)

// SR Configuration

#define TIM2_SR_CC4OF                       (0x1U<<12)
#define TIM2_SR_CC3OF                       (0x1U<<11)
#define TIM2_SR_CC2OF                       (0x1U<<10)
#define TIM2_SR_CC1OF                       (0x1U<<9)
#define TIM2_SR_TIF                         (0x1U<<6)
#define TIM2_SR_CC4IF                       (0x1U<<4)
#define TIM2_SR_CC3IF                       (0x1U<<3)
#define TIM2_SR_CC2IF                       (0x1U<<2)
#define TIM2_SR_CC1IF                       (0x1U<<1)
#define TIM2_SR_UIF                         (0x1U<<0)
#define TIM2_SR_CC1OF_B_0X0                 (0x0U<<9)
#define TIM2_SR_CC1OF_B_0X1                 (0x1U<<9)
#define TIM2_SR_TIF_B_0X0                   (0x0U<<6)
#define TIM2_SR_TIF_B_0X1                   (0x1U<<6)
#define TIM2_SR_CC1IF_B_0X0                 (0x0U<<1)
#define TIM2_SR_CC1IF_B_0X1                 (0x1U<<1)
#define TIM2_SR_UIF_B_0X0                   (0x0U<<0)
#define TIM2_SR_UIF_B_0X1                   (0x1U<<0)

// EGR Configuration

#define TIM2_EGR_TG                         (0x1U<<6)
#define TIM2_EGR_CC4G                       (0x1U<<4)
#define TIM2_EGR_CC3G                       (0x1U<<3)
#define TIM2_EGR_CC2G                       (0x1U<<2)
#define TIM2_EGR_CC1G                       (0x1U<<1)
#define TIM2_EGR_UG                         (0x1U<<0)
#define TIM2_EGR_TG_B_0X0                   (0x0U<<6)
#define TIM2_EGR_TG_B_0X1                   (0x1U<<6)
#define TIM2_EGR_CC1G_B_0X0                 (0x0U<<1)
#define TIM2_EGR_CC1G_B_0X1                 (0x1U<<1)
#define TIM2_EGR_UG_B_0X0                   (0x0U<<0)
#define TIM2_EGR_UG_B_0X1                   (0x1U<<0)

// CCMR1 Configuration

#define TIM2_CCMR1_IC2F                     (0xFU<<12)
#define TIM2_CCMR1_IC2F_0                   (0x1U<<12)
#define TIM2_CCMR1_IC2PSC                   (0x3U<<10)
#define TIM2_CCMR1_IC2PSC_0                 (0x1U<<10)
#define TIM2_CCMR1_CC2S                     (0x3U<<8)
#define TIM2_CCMR1_CC2S_0                   (0x1U<<8)
#define TIM2_CCMR1_IC1F                     (0xFU<<4)
#define TIM2_CCMR1_IC1F_0                   (0x1U<<4)
#define TIM2_CCMR1_IC1PSC                   (0x3U<<2)
#define TIM2_CCMR1_IC1PSC_0                 (0x1U<<2)
#define TIM2_CCMR1_CC1S                     (0x3U<<0)
#define TIM2_CCMR1_CC1S_0                   (0x1U<<0)
#define TIM2_CCMR1_CC2S_B_0X0               (0x0U<<8)
#define TIM2_CCMR1_CC2S_B_0X1               (0x1U<<8)
#define TIM2_CCMR1_CC2S_B_0X2               (0x2U<<8)
#define TIM2_CCMR1_CC2S_B_0X3               (0x3U<<8)
#define TIM2_CCMR1_IC1F_B_0X0               (0x0U<<4)
#define TIM2_CCMR1_IC1F_B_0X1               (0x1U<<4)
#define TIM2_CCMR1_IC1F_B_0X2               (0x2U<<4)
#define TIM2_CCMR1_IC1F_B_0X3               (0x3U<<4)
#define TIM2_CCMR1_IC1F_B_0X4               (0x4U<<4)
#define TIM2_CCMR1_IC1F_B_0X5               (0x5U<<4)
#define TIM2_CCMR1_IC1F_B_0X6               (0x6U<<4)
#define TIM2_CCMR1_IC1F_B_0X7               (0x7U<<4)
#define TIM2_CCMR1_IC1F_B_0X8               (0x8U<<4)
#define TIM2_CCMR1_IC1F_B_0X9               (0x9U<<4)
#define TIM2_CCMR1_IC1F_B_0XA               (0xAU<<4)
#define TIM2_CCMR1_IC1F_B_0XB               (0xBU<<4)
#define TIM2_CCMR1_IC1F_B_0XC               (0xCU<<4)
#define TIM2_CCMR1_IC1F_B_0XD               (0xDU<<4)
#define TIM2_CCMR1_IC1F_B_0XE               (0xEU<<4)
#define TIM2_CCMR1_IC1F_B_0XF               (0xFU<<4)
#define TIM2_CCMR1_IC1PSC_B_0X0             (0x0U<<2)
#define TIM2_CCMR1_IC1PSC_B_0X1             (0x1U<<2)
#define TIM2_CCMR1_IC1PSC_B_0X2             (0x2U<<2)
#define TIM2_CCMR1_IC1PSC_B_0X3             (0x3U<<2)
#define TIM2_CCMR1_CC1S_B_0X0               (0x0U<<0)
#define TIM2_CCMR1_CC1S_B_0X1               (0x1U<<0)
#define TIM2_CCMR1_CC1S_B_0X2               (0x2U<<0)
#define TIM2_CCMR1_CC1S_B_0X3               (0x3U<<0)

// CCMR1_ALTERNATE Configuration

#define TIM2_CCMR1_ALTERNATE_OC2M_1         (0x1U<<24)
#define TIM2_CCMR1_ALTERNATE_OC1M_1         (0x1U<<16)
#define TIM2_CCMR1_ALTERNATE_OC2CE          (0x1U<<15)
#define TIM2_CCMR1_ALTERNATE_OC2M           (0x7U<<12)
#define TIM2_CCMR1_ALTERNATE_OC2M_0         (0x1U<<12)
#define TIM2_CCMR1_ALTERNATE_OC2PE          (0x1U<<11)
#define TIM2_CCMR1_ALTERNATE_OC2FE          (0x1U<<10)
#define TIM2_CCMR1_ALTERNATE_CC2S           (0x3U<<8)
#define TIM2_CCMR1_ALTERNATE_CC2S_0         (0x1U<<8)
#define TIM2_CCMR1_ALTERNATE_OC1CE          (0x1U<<7)
#define TIM2_CCMR1_ALTERNATE_OC1M           (0x7U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1M_0         (0x1U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1PE          (0x1U<<3)
#define TIM2_CCMR1_ALTERNATE_OC1FE          (0x1U<<2)
#define TIM2_CCMR1_ALTERNATE_CC1S           (0x3U<<0)
#define TIM2_CCMR1_ALTERNATE_CC1S_0         (0x1U<<0)
#define TIM2_CCMR1_ALTERNATE_CC2S_B_0X0     (0x0U<<8)
#define TIM2_CCMR1_ALTERNATE_CC2S_B_0X1     (0x1U<<8)
#define TIM2_CCMR1_ALTERNATE_CC2S_B_0X2     (0x2U<<8)
#define TIM2_CCMR1_ALTERNATE_CC2S_B_0X3     (0x3U<<8)
#define TIM2_CCMR1_ALTERNATE_OC1CE_B_0X0    (0x0U<<7)
#define TIM2_CCMR1_ALTERNATE_OC1CE_B_0X1    (0x1U<<7)
#define TIM2_CCMR1_ALTERNATE_OC1M_B_0X0     (0x0U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1M_B_0X1     (0x1U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1M_B_0X2     (0x2U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1M_B_0X3     (0x3U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1M_B_0X4     (0x4U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1M_B_0X5     (0x5U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1M_B_0X6     (0x6U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1M_B_0X7     (0x7U<<4)
#define TIM2_CCMR1_ALTERNATE_OC1PE_B_0X0    (0x0U<<3)
#define TIM2_CCMR1_ALTERNATE_OC1PE_B_0X1    (0x1U<<3)
#define TIM2_CCMR1_ALTERNATE_OC1FE_B_0X0    (0x0U<<2)
#define TIM2_CCMR1_ALTERNATE_OC1FE_B_0X1    (0x1U<<2)
#define TIM2_CCMR1_ALTERNATE_CC1S_B_0X0     (0x0U<<0)
#define TIM2_CCMR1_ALTERNATE_CC1S_B_0X1     (0x1U<<0)
#define TIM2_CCMR1_ALTERNATE_CC1S_B_0X2     (0x2U<<0)
#define TIM2_CCMR1_ALTERNATE_CC1S_B_0X3     (0x3U<<0)

// CCMR2 Configuration

#define TIM2_CCMR2_IC4F                     (0xFU<<12)
#define TIM2_CCMR2_IC4F_0                   (0x1U<<12)
#define TIM2_CCMR2_IC4PSC                   (0x3U<<10)
#define TIM2_CCMR2_IC4PSC_0                 (0x1U<<10)
#define TIM2_CCMR2_CC4S                     (0x3U<<8)
#define TIM2_CCMR2_CC4S_0                   (0x1U<<8)
#define TIM2_CCMR2_IC3F                     (0xFU<<4)
#define TIM2_CCMR2_IC3F_0                   (0x1U<<4)
#define TIM2_CCMR2_IC3PSC                   (0x3U<<2)
#define TIM2_CCMR2_IC3PSC_0                 (0x1U<<2)
#define TIM2_CCMR2_CC3S                     (0x3U<<0)
#define TIM2_CCMR2_CC3S_0                   (0x1U<<0)
#define TIM2_CCMR2_CC4S_B_0X0               (0x0U<<8)
#define TIM2_CCMR2_CC4S_B_0X1               (0x1U<<8)
#define TIM2_CCMR2_CC4S_B_0X2               (0x2U<<8)
#define TIM2_CCMR2_CC4S_B_0X3               (0x3U<<8)
#define TIM2_CCMR2_CC3S_B_0X0               (0x0U<<0)
#define TIM2_CCMR2_CC3S_B_0X1               (0x1U<<0)
#define TIM2_CCMR2_CC3S_B_0X2               (0x2U<<0)
#define TIM2_CCMR2_CC3S_B_0X3               (0x3U<<0)

// CCMR2_ALTERNATE Configuration

#define TIM2_CCMR2_ALTERNATE_OC4M_1         (0x1U<<24)
#define TIM2_CCMR2_ALTERNATE_OC3M_1         (0x1U<<16)
#define TIM2_CCMR2_ALTERNATE_OC4CE          (0x1U<<15)
#define TIM2_CCMR2_ALTERNATE_OC4M           (0x7U<<12)
#define TIM2_CCMR2_ALTERNATE_OC4M_0         (0x1U<<12)
#define TIM2_CCMR2_ALTERNATE_OC4PE          (0x1U<<11)
#define TIM2_CCMR2_ALTERNATE_OC4FE          (0x1U<<10)
#define TIM2_CCMR2_ALTERNATE_CC4S           (0x3U<<8)
#define TIM2_CCMR2_ALTERNATE_CC4S_0         (0x1U<<8)
#define TIM2_CCMR2_ALTERNATE_OC3CE          (0x1U<<7)
#define TIM2_CCMR2_ALTERNATE_OC3M           (0x7U<<4)
#define TIM2_CCMR2_ALTERNATE_OC3M_0         (0x1U<<4)
#define TIM2_CCMR2_ALTERNATE_OC3PE          (0x1U<<3)
#define TIM2_CCMR2_ALTERNATE_OC3FE          (0x1U<<2)
#define TIM2_CCMR2_ALTERNATE_CC3S           (0x3U<<0)
#define TIM2_CCMR2_ALTERNATE_CC3S_0         (0x1U<<0)
#define TIM2_CCMR2_ALTERNATE_CC4S_B_0X0     (0x0U<<8)
#define TIM2_CCMR2_ALTERNATE_CC4S_B_0X1     (0x1U<<8)
#define TIM2_CCMR2_ALTERNATE_CC4S_B_0X2     (0x2U<<8)
#define TIM2_CCMR2_ALTERNATE_CC4S_B_0X3     (0x3U<<8)
#define TIM2_CCMR2_ALTERNATE_CC3S_B_0X0     (0x0U<<0)
#define TIM2_CCMR2_ALTERNATE_CC3S_B_0X1     (0x1U<<0)
#define TIM2_CCMR2_ALTERNATE_CC3S_B_0X2     (0x2U<<0)
#define TIM2_CCMR2_ALTERNATE_CC3S_B_0X3     (0x3U<<0)

// CCER Configuration

#define TIM2_CCER_CC4NP                     (0x1U<<15)
#define TIM2_CCER_CC4P                      (0x1U<<13)
#define TIM2_CCER_CC4E                      (0x1U<<12)
#define TIM2_CCER_CC3NP                     (0x1U<<11)
#define TIM2_CCER_CC3P                      (0x1U<<9)
#define TIM2_CCER_CC3E                      (0x1U<<8)
#define TIM2_CCER_CC2NP                     (0x1U<<7)
#define TIM2_CCER_CC2P                      (0x1U<<5)
#define TIM2_CCER_CC2E                      (0x1U<<4)
#define TIM2_CCER_CC1NP                     (0x1U<<3)
#define TIM2_CCER_CC1P                      (0x1U<<1)
#define TIM2_CCER_CC1E                      (0x1U<<0)
#define TIM2_CCER_CC1P_B_0X0                (0x0U<<1)
#define TIM2_CCER_CC1P_B_0X1                (0x1U<<1)
#define TIM2_CCER_CC1E_B_0X0                (0x0U<<0)
#define TIM2_CCER_CC1E_B_0X1                (0x1U<<0)

// CNT Configuration

#define TIM2_CNT_CNT                        (0xFFFFFFFFU<<0)
#define TIM2_CNT_CNT_0                      (0x1U<<0)

// CNT_ALTERNATE Configuration

#define TIM2_CNT_ALTERNATE_UIFCPY           (0x1U<<31)
#define TIM2_CNT_ALTERNATE_CNT              (0x7FFFFFFFU<<0)
#define TIM2_CNT_ALTERNATE_CNT_0            (0x1U<<0)

// PSC Configuration

#define TIM2_PSC_PSC                        (0xFFFFU<<0)
#define TIM2_PSC_PSC_0                      (0x1U<<0)

// ARR Configuration

#define TIM2_ARR_ARR                        (0xFFFFFFFFU<<0)
#define TIM2_ARR_ARR_0                      (0x1U<<0)

// CCR1 Configuration

#define TIM2_CCR1_CCR1                      (0xFFFFFFFFU<<0)
#define TIM2_CCR1_CCR1_0                    (0x1U<<0)

// CCR2 Configuration

#define TIM2_CCR2_CCR2                      (0xFFFFFFFFU<<0)
#define TIM2_CCR2_CCR2_0                    (0x1U<<0)

// CCR3 Configuration

#define TIM2_CCR3_CCR3                      (0xFFFFFFFFU<<0)
#define TIM2_CCR3_CCR3_0                    (0x1U<<0)

// CCR4 Configuration

#define TIM2_CCR4_CCR4                      (0xFFFFFFFFU<<0)
#define TIM2_CCR4_CCR4_0                    (0x1U<<0)

// DCR Configuration

#define TIM2_DCR_DBL                        (0x1FU<<8)
#define TIM2_DCR_DBL_0                      (0x1U<<8)
#define TIM2_DCR_DBA                        (0x1FU<<0)
#define TIM2_DCR_DBA_0                      (0x1U<<0)
#define TIM2_DCR_DBL_B_0X0                  (0x0U<<8)
#define TIM2_DCR_DBL_B_0X1                  (0x1U<<8)
#define TIM2_DCR_DBL_B_0X2                  (0x2U<<8)
#define TIM2_DCR_DBL_B_0X11                 (0x11U<<8)
#define TIM2_DCR_DBA_B_0X0                  (0x0U<<0)
#define TIM2_DCR_DBA_B_0X1                  (0x1U<<0)
#define TIM2_DCR_DBA_B_0X2                  (0x2U<<0)

// DMAR Configuration

#define TIM2_DMAR_DMAB                      (0xFFFFU<<0)
#define TIM2_DMAR_DMAB_0                    (0x1U<<0)

// AF1 Configuration

#define TIM2_AF1_ETRSEL                     (0xFU<<14)
#define TIM2_AF1_ETRSEL_0                   (0x1U<<14)
#define TIM2_AF1_ETRSEL_B_0X0               (0x0U<<14)
#define TIM2_AF1_ETRSEL_B_0X1               (0x1U<<14)
#define TIM2_AF1_ETRSEL_B_0X2               (0x2U<<14)
#define TIM2_AF1_ETRSEL_B_0X3               (0x3U<<14)
#define TIM2_AF1_ETRSEL_B_0X4               (0x4U<<14)
#define TIM2_AF1_ETRSEL_B_0X5               (0x5U<<14)

// TISEL Configuration

#define TIM2_TISEL_TI4SEL                   (0xFU<<24)
#define TIM2_TISEL_TI4SEL_0                 (0x1U<<24)
#define TIM2_TISEL_TI3SEL                   (0xFU<<16)
#define TIM2_TISEL_TI3SEL_0                 (0x1U<<16)
#define TIM2_TISEL_TI2SEL                   (0xFU<<8)
#define TIM2_TISEL_TI2SEL_0                 (0x1U<<8)
#define TIM2_TISEL_TI1SEL                   (0xFU<<0)
#define TIM2_TISEL_TI1SEL_0                 (0x1U<<0)
#define TIM2_TISEL_TI4SEL_B_0X0             (0x0U<<24)
#define TIM2_TISEL_TI4SEL_B_0X1             (0x1U<<24)
#define TIM2_TISEL_TI4SEL_B_0X2             (0x2U<<24)
#define TIM2_TISEL_TI4SEL_B_0X3             (0x3U<<24)
#define TIM2_TISEL_TI3SEL_B_0X0             (0x0U<<16)
#define TIM2_TISEL_TI2SEL_B_0X0             (0x0U<<8)
#define TIM2_TISEL_TI1SEL_B_0X0             (0x0U<<0)
